# Третє завдання (не обов'язкове)
# У вашій компанії ведеться активна маркетингова кампанія за
# допомогою SMS-розсилок. Для цього ви збираєте телефонні номери
# клієнтів із бази даних, але часто стикаєтеся з тим, що номери
# записані у різних форматах. Ваш сервіс розсилок може ефективно
# відправляти повідомлення лише тоді, коли номери телефонів представлені
# у коректному форматі. Тому вам необхідна функція, яка автоматично нормалізує
# номери телефонів до потрібного формату, видаляючи всі зайві символи
# та додаючи міжнародний код країни, якщо потрібно.
import re


def normalize_phone(phone_number):
    pattern = r"[\D]"
    normal_number = re.sub(pattern, "", phone_number)
    pattern = r"^"
    if "380" == normal_number[:3:]:
        repl = r"+"
    else:
        repl = r"+38"
    normal_number = re.sub(pattern, repl, normal_number)
    return normal_number


raw_numbers = [
    "067\\t123 4567",
    "(095) 234-5678\\n",
    "+380 44 123 4567",
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   ",
]

sanitized_numbers = [normalize_phone(num) for num in raw_numbers]
print("Нормалізовані номери телефонів для SMS-розсилки:", sanitized_numbers)
